# **Pandas LAB**

### Step 1. Import the necessary libraries

In [ ]:
import pandas as pd

### Step 2. Get the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

In [4]:
df = pd.read_csv('occupation.txt',sep='|')
df

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [5]:
df = pd.read_csv('occupation.txt',sep='|',index_col='user_id')
df

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
...      ...    ...            ...      ...
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

[943 rows x 4 columns]

### Step 4. See the first 25 entries

In [6]:
df.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

### Step 5. See the last 10 entries

In [7]:
df.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

### Step 6. What is the number of observations in the dataset?

In [8]:
len(df)

943

### Step 7. What is the number of columns in the dataset?

In [9]:
len(df.columns)

4

In [12]:
len(df.keys())

4

### Step 8. Print the name of all the columns.

In [10]:
list(df.columns)

['age', 'gender', 'occupation', 'zip_code']

In [13]:
list(df.keys())

['age', 'gender', 'occupation', 'zip_code']

### Step 9. How is the dataset indexed?

In [14]:
df.index

Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
       ...
       934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
      dtype='int64', name='user_id', length=943)

### Step 10. What is the data type of each column?

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

In [16]:
df.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### Step 11. Print only the occupation column

In [17]:
df['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

### Step 12. How many different occupations are in this dataset?

In [18]:
df['occupation'].unique()

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

### Step 13. What is the most frequent occupation?

In [21]:
df['occupation'].value_counts().index[0]

'student'

In [19]:
df['occupation'].mode()

0    student
Name: occupation, dtype: object

### Step 14. Summarize the DataFrame.

In [23]:
df.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

## **Group by Operations**

### Count the number of users in each occupation.

In [27]:
df.groupby('occupation')['occupation'].count()

occupation
administrator     79
artist            28
doctor             7
educator          95
engineer          67
entertainment     18
executive         32
healthcare        16
homemaker          7
lawyer            12
librarian         51
marketing         26
none               9
other            105
programmer        66
retired           14
salesman          12
scientist         31
student          196
technician        27
writer            45
Name: occupation, dtype: int64

### Calculate the average age of users by gender.

In [28]:
df.groupby('gender')['age'].mean()

gender
F    33.813187
M    34.149254
Name: age, dtype: float64

### Find the minimum, maximum, and average age for each occupation.

In [29]:
df.groupby('occupation')['age'].agg(['min','max','mean'])

               min  max       mean
occupation
administrator   21   70  38.746835
artist          19   48  31.392857
doctor          28   64  43.571429
educator        23   63  42.010526
engineer        22   70  36.388060
entertainment   15   50  29.222222
executive       22   69  38.718750
healthcare      22   62  41.562500
homemaker       20   50  32.571429
lawyer          21   53  36.750000
librarian       23   69  40.000000
marketing       24   55  37.615385
none            11   55  26.555556
other           13   64  34.523810
programmer      20   63  33.121212
retired         51   73  63.071429
salesman        18   66  35.666667
scientist       23   55  35.548387
student          7   42  22.081633
technician      21   55  33.148148
writer          18   60  36.311111

### For each occupation, calculate the percentage of users who are male.

In [ ]:
# Define a function to calculate the percentage of males in each group
def male_percentage(x):
    return (x == 'M').mean() * 100

df.groupby('occupation')['gender'].apply(male_percentage)

occupation
administrator     54.430380
artist            53.571429
doctor           100.000000
educator          72.631579
engineer          97.014925
entertainment     88.888889
executive         90.625000
healthcare        31.250000
homemaker         14.285714
lawyer            83.333333
librarian         43.137255
marketing         61.538462
none              55.555556
other             65.714286
programmer        90.909091
retired           92.857143
salesman          75.000000
scientist         90.322581
student           69.387755
technician        96.296296
writer            57.777778
Name: gender, dtype: float64

## **Filtering**

### Filter the dataset to show only female users.

In [32]:
df[df['gender'] == 'F']

         age gender  occupation zip_code
user_id
2         53      F       other    94043
5         33      F       other    15213
11        39      F       other    30329
12        28      F       other    06405
15        49      F    educator    97301
...      ...    ...         ...      ...
925       18      F    salesman    49036
930       28      F   scientist    07310
938       38      F  technician    55038
939       26      F     student    33319
942       48      F   librarian    78209

[273 rows x 4 columns]

### Filter the dataset to show users who are either students or educators.

In [ ]:
# Way 1 : using logical OR operator
df[(df['occupation'] == 'student') | (df['occupation'] == 'educator')]

         age gender occupation zip_code
user_id
9         29      M    student    01002
13        47      M   educator    29206
15        49      F   educator    97301
30         7      M    student    55436
32        28      F    student    78741
...      ...    ...        ...      ...
933       28      M    student    48105
937       48      M   educator    98072
939       26      F    student    33319
941       20      M    student    97229
943       22      M    student    77841

[291 rows x 4 columns]

In [ ]:
# Way 2 : using .isin() method
df[df['occupation'].isin(['student', 'educator'])]

         age gender occupation zip_code
user_id
9         29      M    student    01002
13        47      M   educator    29206
15        49      F   educator    97301
30         7      M    student    55436
32        28      F    student    78741
...      ...    ...        ...      ...
933       28      M    student    48105
937       48      M   educator    98072
939       26      F    student    33319
941       20      M    student    97229
943       22      M    student    77841

[291 rows x 4 columns]

### Filter the dataset to show female users who are in their 20s (20-29).

In [36]:
df[(df['gender'] == 'F') & (df['age'].between(20,30))]

         age gender     occupation zip_code
user_id
12        28      F          other    06405
23        30      F         artist    48197
24        21      F         artist    94533
32        28      F        student    78741
35        20      F      homemaker    42459
...      ...    ...            ...      ...
920       30      F         artist    90008
921       20      F        student    98801
922       29      F  administrator    21114
930       28      F      scientist    07310
939       26      F        student    33319

[97 rows x 4 columns]

### Filter the dataset to find users from California (zip codes starting with '9')

In [38]:
df[df['zip_code'].astype(str).str.endswith('9')]

         age gender     occupation zip_code
user_id
11        39      F          other    30329
16        21      M  entertainment    10309
28        32      M         writer    55369
35        20      F      homemaker    42459
51        28      M       educator    16509
...      ...    ...            ...      ...
887       14      F        student    27249
936       24      M          other    32789
939       26      F        student    33319
941       20      M        student    97229
942       48      F      librarian    78209

[66 rows x 4 columns]

# **Complex Analysis**

### Create a pivot table showing the count of users by occupation and age decade.
#### age decade: 27 years old --> 20s decade

In [40]:
df['age_decade'] = (df['age'] // 10) * 10
df['age_decade'] = df['age_decade'].astype(str) + 's'

pivot_table = pd.pivot_table(
    data=df,
    values='age',  
    index='occupation', 
    columns='age_decade',  
    aggfunc='count', 
    fill_value=0 
)

print(pivot_table)

age_decade     0s  10s  20s  30s  40s  50s  60s  70s
occupation
administrator   0    0   19   26   20   12    1    1
artist          0    1   12    9    6    0    0    0
doctor          0    0    2    0    3    1    1    0
educator        0    0   12   30   25   23    5    0
engineer        0    0   23   22   14    5    2    1
entertainment   0    2    8    5    2    1    0    0
executive       0    0    7   11   11    2    1    0
healthcare      0    0    4    1    7    3    1    0
homemaker       0    0    3    2    1    1    0    0
lawyer          0    0    4    4    1    3    0    0
librarian       0    0   11   15   13   11    1    0
marketing       0    0    5   12    4    5    0    0
none            0    3    2    3    0    1    0    0
other           0    4   38   29   22   11    1    0
programmer      0    0   30   21   10    3    2    0
retired         0    0    0    0    0    2   10    2
salesman        0    1    2    6    1    1    1    0
scientist       0    0    8   14    8    1    0    0
student         1   63  116   14    2    0    0    0
technician      0    0   12    8    5    2    0    0
writer          0    2   14    9   13    6    1    0